<script setup>
import {computed, ref, onMounted} from 'vue';
import SideCarouselNews from '@/components/SideCarouselNewsBlock.vue';

// const props = defineProps({
//   modelValue: {
//     type: Object,
//     required: false,
//   },
//   ...modeProps,
// });

const emits = defineEmits(['submitted', 'closeForm', 'update:model-value']);

const form = ref(null);

const inputLabelWidth = computed(() => 150);

const cardTitle = computed(() => props.mode === 'add' ? 'Добавление заказа' : 'Редактирование заказа');

const fd = ref({});

const dataLoaded = ref(false);

const carousel = ref({
  image: 'didenko.jpg',
  title: 'Избран глава союзов городов Центра и Северо-Запада Российской Федерации',
  text: 'В Великом Новгороде прошло отчетно-выборное общее собрание Союза городов Центра и Северо-Запада России. Одним из пунктов повестки дня были выборы главы СГЦСЗР. По итогам голосования президентом Союза был переизбран новгородский мэр Юрий Бобрышев - его кандидатуру выдвинул глава Пскова Иван Цецерский. Вице-президентами СГЦСЗР были избраны мэры Вологды  и Твери - Евгений Шулепов и Александр Корзин. В состав правления помимо Цецерского вошли глава Калининграда Александр Ярошук, мэр Череповца Юрий Кузин, председатель Ивановской городской думы Александр Кузьмичев и исполняющий обязанности мэра Ярославля Алексей Малютин. На сегодняшний день Союз городов Центра и Северо-Запада России объединяет 27 городов с населением около шести миллионов жителей. Его территория простирается от Калининграда до Сыктывкара с запада на восток и от Нарьян-Мара до Владимира с севера на юг. Основная задача Союза - обмен опытом в области местного управления. Юрий Бобрышев занимает пост главы СГЦСЗР с 2012 года. Источник: СГЦСЗР'
});

const carouselList = [
  {
    image: 'didenko.jpg',
    title: 'Избран глава союзов городов Центра и Северо-Запада Российской Федерации',
    text: 'В Великом Новгороде прошло отчетно-выборное общее собрание Союза городов Центра и Северо-Запада России. Одним из пунктов повестки дня были выборы главы СГЦСЗР. По итогам голосования президентом Союза был переизбран новгородский мэр Юрий Бобрышев - его кандидатуру выдвинул глава Пскова Иван Цецерский. Вице-президентами СГЦСЗР были избраны мэры Вологды  и Твери - Евгений Шулепов и Александр Корзин. В состав правления помимо Цецерского вошли глава Калининграда Александр Ярошук, мэр Череповца Юрий Кузин, председатель Ивановской городской думы Александр Кузьмичев и исполняющий обязанности мэра Ярославля Алексей Малютин. На сегодняшний день Союз городов Центра и Северо-Запада России объединяет 27 городов с населением около шести миллионов жителей. Его территория простирается от Калининграда до Сыктывкара с запада на восток и от Нарьян-Мара до Владимира с севера на юг. Основная задача Союза - обмен опытом в области местного управления. Юрий Бобрышев занимает пост главы СГЦСЗР с 2012 года. Источник: СГЦСЗР'
  },
  {
    image: 'guseva.jpg',
    title: 'Дмитрий Азаров: Создать условия для развития ТОС как основы местного самоуправления',
    text: 'В Великом Новгороде прошло отчетно-выборное общее собрание Союза городов Центра и Северо-Запада России. Одним из пунктов повестки дня были выборы главы СГЦСЗР. По итогам голосования президентом Союза был переизбран новгородский мэр Юрий Бобрышев - его кандидатуру выдвинул глава Пскова Иван Цецерский. Вице-президентами СГЦСЗР были избраны мэры Вологды  и Твери - Евгений Шулепов и Александр Корзин. В состав правления помимо Цецерского вошли глава Калининграда Александр Ярошук, мэр Череповца Юрий Кузин, председатель Ивановской городской думы Александр Кузьмичев и исполняющий обязанности мэра Ярославля Алексей Малютин. На сегодняшний день Союз городов Центра и Северо-Запада России объединяет 27 городов с населением около шести миллионов жителей. Его территория простирается от Калининграда до Сыктывкара с запада на восток и от Нарьян-Мара до Владимира с севера на юг. Основная задача Союза - обмен опытом в области местного управления. Юрий Бобрышев занимает пост главы СГЦСЗР с 2012 года. Источник: СГЦСЗР'
  }
];

onMounted(() => {
  // const model = props.modelValue;
  // fd.value.contract = model.contract;
  // fd.value.contractor = model.contractor;
  // fd.value.anticontractor = model.anticontractor;
  dataLoaded.value = true;
});

const changeCarousel = (i) => {
  carousel.value = carouselList[i];
};

</script>

<template>
  <div class="w100">
    <div class="flex items-end mb-[30px] gap-[15px]">
      <div class="w-auto text-[18px] font-somic text-black font-semibold">Главные новости</div>
      <div class="flex-grow border-b-[2px] border-gray"></div>
    </div>
    <div class="grid grid-cols-4 gap-[25px]">
      <div class="col-span-3 flex flex-col gap-[15px]">
        <img :src="'/images/'+carousel.image" class="" />
        <div class="text-[30px] font-somic text-black font-bold">
          {{ carousel.title }}
        </div>
        <div class="text-[14px] font-somic text-gray-500">
          {{ carousel.text }}
        </div>
      </div>
      <SideCarouselNews @chosen="changeCarousel" />
    </div>
  </div>
</template>
